Tekla.Structures.Datatype.Distance.IsImperialUnit(Tekla.Structures.Datatype.Distance.UnitType)
Checks whether current unit type is imperial.
unitType: The unit type.
Returns: True if the unit type is imperial, false otherwise.

Tekla.Structures.Datatype.Distance.MillimetersInUsSurveyFoot
Conversion factor from foots to millimeters.